; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v2 ?v1)
             (pred_9 ?v8 ?v13)
             (pred_2 ?v2 ?v13)
             (pred_3 ?v3 ?v2 )
	     (pred_10 ?v2)
             (pred_7 ?v11)
             (pred_1 ?v8)
             (pred_8 ?v13)
             (pred_5 ?v2)
             (pred_11 ?v8)
             (pred_4 ?v2)
             (pred_12 ))



(:action op_1
:parameters (?v4 ?v6 ?v10 ?v12)
:precondition (and (pred_7 ?v4) (pred_7 ?v6) (pred_1 ?v10) (pred_8 ?v12)
          (pred_6 ?v4 ?v6) (pred_9 ?v10 ?v12)
                   (pred_2 ?v6 ?v12) (pred_10 ?v4) 
                   (pred_5 ?v6) (pred_11 ?v10))
:effect (and  (pred_4 ?v6) (not (pred_5 ?v6))))


(:action op_3
:parameters (?v4 ?v9)
:precondition (and (pred_7 ?v4) (pred_7 ?v9)
               (pred_10 ?v4) (pred_6 ?v4 ?v9) (pred_4 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v4))))

(:action op_4
:parameters (?v4 ?v10)
:precondition (and (pred_7 ?v4) (pred_1 ?v10) 
                  (pred_10 ?v4) (pred_3 ?v10 ?v4) (pred_12 ))
:effect (and (pred_11 ?v10)
   (not (pred_3 ?v10 ?v4)) (not (pred_12 ))))


(:action op_2
:parameters (?v4 ?v7 ?v5)
:precondition (and (pred_7 ?v4) (pred_1 ?v7) (pred_1 ?v5)
                  (pred_10 ?v4) (pred_11 ?v5) (pred_3 ?v7 ?v4))
:effect (and (pred_11 ?v7) (pred_3 ?v5 ?v4)
        (not (pred_11 ?v5)) (not (pred_3 ?v7 ?v4))))

(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_7 ?v4) (pred_1 ?v10) 
                  (pred_10 ?v4) (pred_11 ?v10))
:effect (and (pred_12 ) (pred_3 ?v10 ?v4) (not (pred_11 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_01 obj_13 obj_25 obj_21 obj_27 obj_23 obj_11 obj_26 obj_07 obj_28 obj_08 obj_04 obj_05 obj_24 obj_17 obj_20 obj_29 obj_18 obj_12 obj_22 obj_09 obj_02 obj_10 obj_06
    obj_16 obj_30
    obj_14 obj_03 obj_19
    )

    (:init
       (pred_12)

       (pred_7 obj_15)
       (pred_7 obj_01)
       (pred_7 obj_13)
       (pred_7 obj_25)
       (pred_7 obj_21)
       (pred_7 obj_27)
       (pred_7 obj_23)
       (pred_7 obj_11)
       (pred_7 obj_26)
       (pred_7 obj_07)
       (pred_7 obj_28)
       (pred_7 obj_08)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_24)
       (pred_7 obj_17)
       (pred_7 obj_20)
       (pred_7 obj_29)
       (pred_7 obj_18)
       (pred_7 obj_12)
       (pred_7 obj_22)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_06)
       (pred_8 obj_16)
       (pred_8 obj_30)
       (pred_1 obj_14)
       (pred_1 obj_03)
       (pred_1 obj_19)

       (pred_6 obj_15 obj_27)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_01 obj_23)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_25)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_25 obj_26)
       (pred_6 obj_25 obj_21)
       (pred_6 obj_25 obj_13)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_25)
       (pred_6 obj_27 obj_28)
       (pred_6 obj_27 obj_23)
       (pred_6 obj_27 obj_15)
       (pred_6 obj_23 obj_08)
       (pred_6 obj_23 obj_11)
       (pred_6 obj_23 obj_01)
       (pred_6 obj_23 obj_27)
       (pred_6 obj_11 obj_04)
       (pred_6 obj_11 obj_26)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_23)
       (pred_6 obj_26 obj_05)
       (pred_6 obj_26 obj_07)
       (pred_6 obj_26 obj_25)
       (pred_6 obj_26 obj_11)
       (pred_6 obj_07 obj_24)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_07 obj_26)
       (pred_6 obj_28 obj_17)
       (pred_6 obj_28 obj_08)
       (pred_6 obj_28 obj_27)
       (pred_6 obj_08 obj_20)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_23)
       (pred_6 obj_08 obj_28)
       (pred_6 obj_04 obj_29)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_11)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_24)
       (pred_6 obj_05 obj_26)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_24 obj_12)
       (pred_6 obj_24 obj_07)
       (pred_6 obj_24 obj_05)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_17 obj_20)
       (pred_6 obj_17 obj_28)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_29)
       (pred_6 obj_20 obj_08)
       (pred_6 obj_20 obj_17)
       (pred_6 obj_29 obj_02)
       (pred_6 obj_29 obj_18)
       (pred_6 obj_29 obj_04)
       (pred_6 obj_29 obj_20)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_18 obj_29)
       (pred_6 obj_12 obj_06)
       (pred_6 obj_12 obj_24)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_22 obj_09)
       (pred_6 obj_22 obj_17)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_09 obj_22)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_29)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_10 obj_06)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_06 obj_12)
       (pred_6 obj_06 obj_10)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_12)
       (pred_2  obj_20 obj_16)
       (pred_2  obj_02 obj_30)
       (pred_2  obj_12 obj_30)
       (pred_4 obj_15)
       (pred_4 obj_01)
       (pred_4 obj_13)
       (pred_4 obj_25)
       (pred_4 obj_21)
       (pred_4 obj_27)
       (pred_4 obj_23)
       (pred_4 obj_11)
       (pred_4 obj_26)
       (pred_4 obj_07)
       (pred_4 obj_28)
       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_24)
       (pred_4 obj_17)
       (pred_4 obj_29)
       (pred_4 obj_18)
       (pred_4 obj_22)
       (pred_4 obj_09)
       (pred_4 obj_10)
       (pred_4 obj_06)

       (pred_9  obj_14 obj_16)
       (pred_9  obj_03 obj_30)
       (pred_9  obj_19 obj_30)
       (pred_3 obj_14 obj_29)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_19 obj_22)
       (pred_10 obj_10)
    )

    (:goal (and
       (pred_3 obj_14 obj_07)
       (pred_3 obj_03 obj_27)
    ))
(:constraints
  (always (not (pred_10 obj_26)))
)
)

; plan
1. (op_3 obj_10 obj_18)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_18)
   goals met: 0 of 2
2. (op_3 obj_18 obj_29)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_29)
   goals met: 0 of 2
3. (op_4 obj_29 obj_14)
   deleted: (pred_3 obj_14 obj_29) (pred_12)
   added: (pred_11 obj_14)
   goals met: 0 of 2
4. (op_3 obj_29 obj_04)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_04)
   goals met: 0 of 2
5. (op_3 obj_04 obj_11)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_11)
   goals met: 0 of 2
6. (op_3 obj_11 obj_13)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_13)
   goals met: 0 of 2
7. (op_3 obj_13 obj_25)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_25)
   goals met: 0 of 2
8. (op_3 obj_25 obj_21)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_21)
   goals met: 0 of 2
9. (op_3 obj_21 obj_07)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_07)
   goals met: 0 of 2
10. (op_5 obj_07 obj_14)
   deleted: (pred_11 obj_14)
   added: (pred_12) (pred_3 obj_14 obj_07)
   goals met: 1 of 2
11. (op_3 obj_07 obj_21)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_21)
   goals met: 1 of 2
12. (op_3 obj_21 obj_25)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_25)
   goals met: 1 of 2
13. (op_3 obj_25 obj_13)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_13)
   goals met: 1 of 2
14. (op_4 obj_13 obj_03)
   deleted: (pred_3 obj_03 obj_13) (pred_12)
   added: (pred_11 obj_03)
   goals met: 1 of 2
15. (op_3 obj_13 obj_01)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_01)
   goals met: 1 of 2
16. (op_3 obj_01 obj_15)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_15)
   goals met: 1 of 2
17. (op_3 obj_15 obj_27)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_27)
   goals met: 1 of 2
18. (op_5 obj_27 obj_03)
   deleted: (pred_11 obj_03)
   added: (pred_12) (pred_3 obj_03 obj_27)
   goals met: 2 of 2
